Documents/Бланк.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Бланк</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипБланка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыБланков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВторой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧека</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продавец1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КтоСообщил</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КакСообщил</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезюмеМенеджераПоКачеству</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезюмеКладовщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженПоНовойСистеме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОперацииЧека</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОперацийЧеков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоККМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоСклад</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоБой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоБойККМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проблема</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыПроблемБланков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникОбращения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсточникиОбращений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОбращения</Name>
							<Comment>Тип обращения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыОбращенийПокупателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИО_Покупателя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>55</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Телефон</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>email</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСобытия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продавец1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Производитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЖалобы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЖалоб</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер_Бланка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер_Карты_ОК</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветПолучен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатОбращения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РезультатыРассмотренияОбращений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПроизв</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИНСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСписанияВозврата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыСписанийИВозвратов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СотрудникМенявшийТипСписанияВозврата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтправленныеСМС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сообщение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Бланк/Forms/ФормаРассылкиСМС/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекстЗапроса="ВЫБРАТЬ
	             |	ОбращенияПокупателей.ФИО_Покупателя КАК ФИО,
	             |	ОбращенияПокупателей.Телефон,
	             |	ОбращенияПокупателей.GUID_Загрузки КАК Бланк,
	             |	ИСТИНА КАК Пометка,
	             |	ОбращенияПокупателей.Номенклатура КАК Товар
	             |ИЗ
	             |	РегистрСведений.ОбращенияПокупателей КАК ОбращенияПокупателей
	             |ГДЕ
	             |	ОбращенияПокупателей.GUID_Загрузки В(&Бланки)
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ОбращенияПокупателей.ФИО_Покупателя,
	             |	ОбращенияПокупателей.Телефон,
	             |	ОбращенияПокупателей.GUID_Загрузки,
	             |	ОбращенияПокупателей.Номенклатура
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Бланк,
	             |	ФИО";
	Запрос=Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Бланки",Параметры.СписокБланков);
	ТО=Запрос.Выполнить().Выгрузить();
	ЗначениеВРеквизитФормы(ТО,"ТаблицаОтправки");
	ЗаполнитьСписокСообщенийСервер();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСМС(Команда)
	Режим = РежимДиалогаВопрос.ДаНет;
	Текст = "ru = ""Отправить сообщения?""";
	Ответ = Вопрос(НСтр(Текст), Режим, 0);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
	    Возврат;
	КонецЕсли;
    
	Предупреждение(КнОтправитьНаСервере());	
КонецПроцедуры

&НаСервере
Функция КнОтправитьНаСервере()
	
	ТО=РеквизитФормыВЗначение("ТаблицаОтправки");
	//АК БЕЛН 10.05.2016++
	ТО.Свернуть("ФИО,Товар,Телефон,Бланк,Пометка");
	ТаблицаОбработаныхПозиций.Очистить();	
	//АК БЕЛН 10.05.2016--
	СтрокиДляОтправки=ТО.НайтиСтроки(Новый Структура("Пометка",Истина));
	
	СтрокаВозврата = "";	
	
	ТекстЗапроса = "insert into [SMSGate].[dbo].[Incoming]
		|      ([Date]
		|      ,[nomer]
		|      ,[text]
		|      ,[Time]
		|      ,[source])
		|select convert(datetime,CONVERT(date,getdate())) , 
		|/**BPar1**/'~~~~~'/**FPar**/ ,
		|/**BPar2**/'^^^^^'/**FPar**/ ,
		|CONVERT(time(7),getdate())  , 10 ;";
		
	СтрокаПодключения = ВнешниеДанные.ПолучитьСтрокуПодключенияMSSQL("srv-sql01", "SMSGate");
		
	Для Каждого СтрокаДляОтправки Из СтрокиДляОтправки Цикл
		Если СтрДлина(Формат(СтрокаДляОтправки.Телефон,"ЧГ=0")) <> 10 Тогда
			// Сообщить о пропуске строки
			Продолжить;
		КонецЕсли;	
		Если ТаблицаОбработаныхПозиций.НайтиСтроки(Новый Структура("ФИО,Товар,Телефон",СтрокаДляОтправки.ФИО,СтрокаДляОтправки.Товар,СтрокаДляОтправки.Телефон)).Количество()=0 Тогда
			СообщениеSMS=ШаблонОтправки.ТекстСообщения;
			СообщениеSMS=СтрЗаменить(СообщениеSMS,"[Товар]",СтрокаДляОтправки.Товар);
			СообщениеSMS=СтрЗаменить(СообщениеSMS,"[ФИО]",СокрЛП(СтрокаДляОтправки.ФИО));
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "~~~~~",Формат(СтрокаДляОтправки.Телефон,"ЧГ=0"));
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "^^^^^",СообщениеSMS);
			
			
			База_ВыполнитьЗапросНеЗаполняяТЗ(ТекстЗапроса, , СтрокаПодключения);
			СтрокаВозврата = "Сообщения отправлены.";
			НовСтр=ТаблицаОбработаныхПозиций.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр,СтрокаДляОтправки);
		КонецЕсли; 
		ДОК=СтрокаДляОтправки.Бланк.ПолучитьОбъект();
		НС=Док.ОтправленныеСМС.Добавить();
		НС.Сообщение=СообщениеSMS;
		Док.Записать(РежимЗаписиДокумента.Запись);
	КонецЦикла;	
	
	Возврат СтрокаВозврата;
	
КонецФункции

&НаСервере
Процедура База_ВыполнитьЗапросНеЗаполняяТЗ(ТекстЗапроса, допПараметры = Неопределено, СтрокаПодключения = "")  
	
	RecordSet = База_ВыполнитьЗапрос(ТекстЗапроса, допПараметры, СтрокаПодключения);
	Попытка
		RecordSet.Close();
	Исключение
	КонецПопытки;	
		
КонецПроцедуры

&НаСервере
Функция База_ВыполнитьЗапрос(ТекстЗапроса, допПараметры = Неопределено, СтрокаПодключения = "")  
	Попытка
		Command = Новый COMОбъект("ADODB.Command");
		
		Если ТипЗнч(допПараметры) = Тип("Структура") тогда
			ЗаполнитьЗначенияСвойств(Command, допПараметры);
		КонецЕсли;			
		CurrentConnection = База_Подключение(СтрокаПодключения);
		Command.ActiveConnection = CurrentConnection;
		Command.CommandTimeout = 0;
		Command.CommandText = ТекстЗапроса;
		RecordSet = Новый COMОбъект("ADODB.RecordSet");
		RecordSet = Command.Execute(); //Выполнение и получение набора данных
		Возврат RecordSet;
	Исключение	
		ВызватьИсключение ОписаниеОшибки();
	КонецПопытки;	
КонецФункции

&НаСервере
Функция База_Подключение(СтрокаПодключения) экспорт	
	
	Попытка
		CurrentConnection = Новый COMОбъект("ADODB.Connection");
		Catalog = Новый COMОбъект("ADOX.Catalog");			
		
		Catalog.ActiveConnection = СтрокаПодключения;
		CurrentConnection.Open(СтрокаПодключения);
		Возврат CurrentConnection;	
		
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();		
		#Если НаКлиенте тогда
		Сообщить(ОписаниеОшибки);			
		#КонецЕсли		
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Процедура ШаблонОтправкиПриИзменении(Элемент)
	ЗаполнитьСписокСообщенийСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокСообщенийСервер()
	ПереченьСообщений.Очистить();
	НомерСтроки=1;
	Для каждого СтрокаДляОтправки Из ТаблицаОтправки Цикл
		НС=ПереченьСообщений.Добавить();
		СообщениеSMS=ШаблонОтправки.ТекстСообщения;
		СообщениеSMS=СтрЗаменить(СообщениеSMS,"[Товар]",СтрокаДляОтправки.Товар);
		СообщениеSMS=СтрЗаменить(СообщениеSMS,"[ФИО]",СтрокаДляОтправки.ФИО);
		НС.НомерСтроки=НомерСтроки;
		НС.НомерТелефона=СтрокаДляОтправки.Телефон;
		НС.ТекстСообщения=СообщениеSMS;
		НомерСтроки=НомерСтроки+1;
	КонецЦикла;	
КонецПроцедуры	

&НаКлиенте
Процедура ТаблицаОтправкиПриИзменении(Элемент)
	ЗаполнитьСписокСообщенийСервер();
КонецПроцедуры
